app/Models/SanchayaTasteModel/SanchayaCustomer.php

    public function getUser($email = false)
    {
        if ($email === false) {
            return $this->findAll();
---
SELECT *
FROM `customer`