app/Models/SanchayaTasteModel/Special.php

    public function getSpecial()
    {
        return $this->findAll();
---
SELECT *
FROM `special`