app/Models/TheWijayaModel/Booking.php

    public function getBookingCustomer($customerId)
    {
        return $this
        ->select('booking.*, room.room_number, room.room_type')
        ->join('room', 'room.id = booking.room_id') // inner join
        ->where('booking.customer_id', $customerId)
        ->orderBy('booking.check_in_date', 'ASC')
        ->findAll();
---
SELECT `booking`.*, `room`.`room_number`, `room`.`room_type`
FROM `booking`
JOIN `room` ON `room`.`id` = `booking`.`room_id`
WHERE `booking`.`customer_id` = 1
ORDER BY `booking`.`check_in_date` ASC