app/Models/TheWijayaModel/Room.php

    public function getRoom()
    {
        return $this->orderBy('price_per_night', 'ASC')->findAll();
---
SELECT *
FROM `room`
ORDER BY `price_per_night` ASC