app/Controllers/TheWijayaController/PaymentController.php

    public function index($bookingId = null)
    {

        // Ambil data booking + join table room untuk info room_number, room_type
        $bookingModel = new Booking();
        $booking = $bookingModel
            ->select('booking.*, room.room_number, room.room_type, room.price_per_night')
            ->join('room', 'room.id = booking.room_id')
            ->where('booking.id', $bookingId)
            ->first();
---
SELECT `booking`.*, `room`.`room_number`, `room`.`room_type`, `room`.`price_per_night`
FROM `booking`
JOIN `room` ON `room`.`id` = `booking`.`room_id`
WHERE `booking`.`id` = '2'
 LIMIT 1